/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50721
Source Host           : localhost:3306
Source Database       : book

Target Server Type    : MYSQL
Target Server Version : 50721
File Encoding         : 65001

Date: 2018-02-08 09:22:03
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for act
-- ----------------------------
DROP TABLE IF EXISTS `act`;
CREATE TABLE `act` (
  `activeid` int(20) NOT NULL AUTO_INCREMENT,
  `openid` varchar(50) DEFAULT NULL,
  `activeName` varchar(20) DEFAULT NULL,
  `activeTime` varchar(20) DEFAULT NULL,
  `activeText` varchar(20) DEFAULT NULL,
  `activePlace` varchar(20) DEFAULT NULL,
  `activeState` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`activeid`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of act
-- ----------------------------
INSERT INTO `act` VALUES ('1', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '交流会', '2017/08/08', '交流测试测试', '工大西街', '2');
INSERT INTO `act` VALUES ('2', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '书友会', '2018/02/03', '测试测试测试', '孵化园', '1');
INSERT INTO `act` VALUES ('3', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '喝茶', '2017/05/23', '测试测试测试测试', '高新', '2');
INSERT INTO `act` VALUES ('4', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '交流会', '2018/01/01', '测试测试', '工大西街', '2');
INSERT INTO `act` VALUES ('6', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '读书会', '三月读书会', '2018/02/04', 'undefined', '1');
INSERT INTO `act` VALUES ('7', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '11', '11', '11', '钦善斋食府', '1');
INSERT INTO `act` VALUES ('8', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '222', '333', '33', '蜀汉公寓', '1');
INSERT INTO `act` VALUES ('9', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '56', '666', '66', '中国农业银行(武侯支行)', '1');
INSERT INTO `act` VALUES ('10', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', 'ggg', 'jjjj', 'kkkk', '天府软件园(E区)', '1');
INSERT INTO `act` VALUES ('11', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '1111', '111', '2018-09-01', '武侯区人民政府', '1');
INSERT INTO `act` VALUES ('12', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '222', '222', '2018-02-01', '武侯区人民政府', '1');
INSERT INTO `act` VALUES ('13', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', 'undefined', 'undefined', 'undefined', 'undefined', '1');
INSERT INTO `act` VALUES ('14', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '2222', '2222', '2018-09-01', '钦善斋食府', '1');

-- ----------------------------
-- Table structure for admin
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
  `username` varchar(20) DEFAULT NULL,
  `password` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of admin
-- ----------------------------
INSERT INTO `admin` VALUES ('admin', 'admin');

-- ----------------------------
-- Table structure for book
-- ----------------------------
DROP TABLE IF EXISTS `book`;
CREATE TABLE `book` (
  `bookid` int(20) NOT NULL AUTO_INCREMENT,
  `bookname` varchar(255) DEFAULT NULL,
  `author` varchar(255) DEFAULT NULL,
  `bookManPhone` varchar(20) DEFAULT NULL,
  `bookState` int(2) DEFAULT '1',
  `bookMoney` double DEFAULT NULL,
  `bookPlace` varchar(255) DEFAULT NULL,
  `bookcount` int(10) DEFAULT NULL,
  `bookIntroduce` varchar(10000) DEFAULT NULL,
  `amount` int(255) DEFAULT NULL,
  `bookflag` int(2) DEFAULT NULL,
  `storeid` int(20) DEFAULT NULL,
  `bookimgurl` varchar(200) DEFAULT NULL,
  `bookclass` varchar(20) DEFAULT NULL,
  `scene` varchar(50) DEFAULT NULL,
  `average` varchar(10) DEFAULT '0',
  `publisher` varchar(50) DEFAULT NULL,
  `pubdate` varchar(50) DEFAULT NULL,
  `tags0` varchar(255) DEFAULT NULL,
  `tags1` varchar(255) DEFAULT NULL,
  `tags2` varchar(255) DEFAULT NULL,
  `bookProvider` varchar(20) DEFAULT NULL,
  `shareCode` varchar(50) DEFAULT NULL,
  `openid` varchar(50) DEFAULT NULL,
  `sharedTime` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`bookid`)
) ENGINE=InnoDB AUTO_INCREMENT=10084 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of book
-- ----------------------------
INSERT INTO `book` VALUES ('10000', '小王子', '[法] 圣埃克苏佩里 / [法] 安东尼·德·圣-埃克苏佩里 ', null, '1', '1', null, '4', '小王子是一个超凡脱俗的仙童，他住在一颗只比他大一丁点儿的小行星上。陪伴他的是一朵他非常喜爱的小玫瑰花。但玫瑰花的虚荣心伤害了小王子对她的感情。小王子告别小行星，开始了遨游太空的旅行。他先后访问了六个行星，各种见闻使他陷入忧伤，他感到大人们荒唐可笑、太不正常。只有在其中一个点灯人的星球上，小王子才找到一个可以作为朋友的人。但点灯人的天地又十分狭小，除了点灯人他自己，不能容下第二个人。在地理学家的指点下，孤单的小王子来到人类居住的地球。\r\n\r\n小王子发现人类缺乏想象力，只知像鹦鹉那样重复别人讲过的话。小王子这时越来越思念自己星球上的那枝小玫瑰。后来，小王子遇到一只小狐狸，小王子用耐心征服了小狐狸，与它结成了亲密的朋友。小狐狸把自己心中的秘密——肉眼看不见事务的本质，只有用心灵才能洞察一切——作为礼物，送给小王子。用这个秘密，小王子在撒哈拉大沙漠与遇险的飞行员一起找到了生命的泉水。最后，小王子在蛇的帮助下离开地球，重新回到他的B612号小行星上。\r\n\r\n童话描写小王子没有被成人那骗人的世界所征服，而最终找到自己的理想。这理想就是连结宇宙万物的爱，而这种爱又是世间所缺少的。因此，小王子常常流露出一种伤感的情绪。作者圣埃克絮佩里在献辞中说：这本书是献给长成了大人的从前那个孩子。\r\n\r\n《小王子》不仅赢得了儿童读者，也为成年人所喜爱，作品凝练的语言渗透了作者对人类及人类文明深邃的思索。它所表现出的讽刺与幻想，真情与哲理，使之成为法国乃至世界上最为著名的一部童话小说。', '1', null, '6', 'https://img1.doubanio.com/lpic/s1237549.jpg', null, '10000', '9.0', '人民文学出版社', '2003-8', '小王子', '童话', '法国', null, null, '', null);
INSERT INTO `book` VALUES ('10001', '最后的精灵', '希瓦娜·达玛利 ', null, '1', '2', null, '3', '每个人心中都有一个最后的精灵\r\n\r\n迫不及待想与最爱的人分享的故事\r\n\r\n欧洲当世唯一可与《小王子》媲美的生命寓言\r\n\r\n意大利、法国、日本三国诺贝尔文学奖获得者温馨分享的成人童话\r\n\r\n英法德美日等十国图书馆协会同时推荐的当代作品\r\n\r\n每个人心中都有一个最后的精灵，他纯真、善良、孤独、勇敢，渴望爱和关怀。\r\n\r\n——（日）大江健三郎\r\n\r\n最后的精灵就是我们心中居住的那个小孩子，我一直抗拒进入成年人的世界，如果早一天看到这本书，也许会改变我的写作轨迹。\r\n\r\n——（法）勒•克莱齐奥\r\n\r\n美妙的角色组成的美妙的故事，鼓舞每个人勇敢地面对自己内心的脆弱，充满了温柔的力量。\r\n\r\n——（意）达里奥•福\r\n\r\n2004年意大利安徒生小说金奖，2005年英国图书馆协会推荐首选图书\r\n\r\n2005年德国图书馆协会推荐图书，2005年芬兰图书馆协会推荐图书\r\n\r\n2006年法国文学小说组金奖，2007年西班牙图书馆协会推荐首选图书\r\n\r\n2008年美国图书馆学会推荐图书，年度外国小说奖\r\n\r\n读者推荐\r\n\r\n透过精灵和人类的接触，让彼此更了解自己世界的实质，充满了温暖和幽默。\r\n\r\n——小野\r\n\r\n《最后的精灵》是充满人性描写的精彩故事，全书弥漫史诗般的悲壮，让人不忍停歇，只为分享小精灵的英雄式孤寂。\r\n\r\n——尼古拉的书斋\r\n\r\n书中出人意料的幽默与刻骨铭心的情节，让读者深深体会故事的力量与牺牲的真谛。\r\n\r\n——莎拉‧克利（纽约公立图书馆月刊）\r\n\r\n这本小说借着精灵约许的发现之旅展现了天真无邪与智慧。\r\n\r\n——布伦斯伯里网络书店书评\r\n\r\n作者在悲伤与幽默间取得微妙的平衡，笑点的背后酝酿深沉的省思。推荐本书给正处人生黑暗时刻、需要希望之光的朋友。———拉蒂‧坦恩斯\r\n\r\n内容简介\r\n\r\n外婆说得对，只要梦想得够用力、够多，让自己充满了信心，你的希望就能实现。一个梦想与坚持的故事，让人看一眼就无法停止的故事。\r\n\r\n在大雨不停降落，遍地烂泥的末日世界里，全世界硕果仅存的小精灵—约许克仑斯凯乌尔科卓尔奈尔斯群克（以人类的智慧而言，叫约许比较容易些），为了逃难，只身流浪到对精灵极为不友善的人间。未曾与人类接触过的约许，遇到了莎琴娜和猎人蒙瑟，然而这只“才出生没多久”，性格天真烂漫到有点不知死活的小精灵，着实让人类无奈到快要抓狂！于是，一场大雨泥泞中的长途跋涉，看来竟有点像是欢乐的冒险……', '1', null, '5', 'https://img1.doubanio.com/lpic/s3874387.jpg', null, '10001', '8.3', '河南文艺出版社', '2009-7', ' 小说', '成长', '外国文学', null, null, null, null);
INSERT INTO `book` VALUES ('10002', '王尔德童话', '[爱尔兰] 奥斯卡·王尔德 ', null, '1', '3', null, '1', '王尔德是19世纪英国最伟大的艺术家之一，以其剧作、诗歌、童话和小说名世。在风流才子那颓废唯美、狷狂放浪的表面姿态下，是一颗纯美纯善，永难泯灭的童心。而这可贵童心一经与卓绝才智结合，便诞生了《王尔德童话》。它不仅为作者奠定了文学声名的基石，更成为世界文学宝库中的传世佳作。其语言纯正优美堪称典范，其意境高洁悠远益人心智，值得向每一个童稚未凿的孩子、每一位葆有赤子之心的成人郑重推荐。', '1', null, '3', 'https://img3.doubanio.com/lpic/s2019056.jpg', null, '10002', '9.1', '译林出版社', '2003-6', '王尔德', '童话', '王尔德童话', null, null, null, null);
INSERT INTO `book` VALUES ('10003', '夜莺与玫瑰', '兰] 奥斯卡·王尔德 / 绘者 [英] 查尔斯·罗宾逊 ', null, '1', '3', null, '2', '《夜莺与玫瑰》是王尔德所著的童话作品经典选集，共收录了他的《夜莺与玫瑰》《幸福王子》《巨人的花园》《忠实的朋友》《驰名的火箭》和《星孩儿》七部脍炙人口的经典作品。这些作品，由民国时期著名的大才女林徽因翻译而成。林徽因的文字优美自然、富有灵气，充满了恬静的女性美。译文后面并附录了完整的英文原文，读者可以感受英国天才作家王尔德的语言魅力。\r\n\r\n书中的插图由19世纪末20世纪初英国出版黄金时代的插画大师查尔斯·罗宾逊于1913年绘制，是最早为王尔德童话绘图的画家。这些插图精致活泼，意境深远，本身就具备了很高的艺术价值。\r\n\r\n《夜莺与玫瑰》是王尔德童话的经典选集，于1888年首次出版，问世后立即引起轰动，并永久地载入英国儿童文学史，由此奠定了王尔德在童话领域内不亚于安徒生的伟大地位。1913年，英国插画大师查尔斯·罗宾逊成为给王尔德童话绘制插图的第一位大艺术家。\r\n\r\n王尔德的童话被誉为“世界上最美丽的童话”，也被称为“世界上最感人的童话”。在他的每部作品中，几乎都有一个因为“至爱”而变得“至美”的形象。据说王尔德在给儿子诵读自己的作品时，也会因此感动得潸然泪下。\r\n\r\n被胡适誉为一代大才女的林徽因，对王尔德的童话一直情有独钟。她在照顾爱人梁思成住院期间，翻译了王尔德被誉为“比生命更可爱的爱情”的童话，以此表达自己对爱情的忠贞。林徽因由此成为继周作人、穆木天之后，第三位向国人介绍王尔德童话作品的中国作家。', '1', null, '8', 'https://img3.doubanio.com/lpic/s10345525.jpg', null, '10003', '8.5', '辽宁教育出版社', '2011-9', '奥斯卡·王尔德', '童话', '林徽因', null, null, null, null);
INSERT INTO `book` VALUES ('10004', '猜猜我有多爱你', '英] 山姆·麦克布雷尼 文 / 安妮塔·婕朗 图 ', null, '1', '2', null, '1', '孩子总喜欢和别人比较，在《猜猜我有多爱你》这本图画书中的小兔子就是个典型的例子。小兔子认真的告诉大兔子“我好爱你”，而大兔子回应小兔子说：“我更爱你！”如此一来，不仅确定大兔子很爱自己，更希望自己的爱能胜过大兔子的爱。牠想尽办法用各种身体动作、看得见的景物来描述自己的爱意，直到牠累得在大兔子的怀中睡着了。\r\n\r\n这本图画书里有一只像孩子的小兔子和一只像爸爸的大兔子。小兔子像所有的孩子一样爱比较。它们俩在比赛谁的爱更多一些。大兔子用智慧赢得了比赛和小兔子稍微少一点的爱，可小兔子用它的天真和想象赢得了大兔子多出一倍的爱。两只兔子都获胜了。整个作品充溢着爱的气氛和快乐的童趣，小兔子亲切可爱的形象、两只兔子相互较劲的故事构架以及形象、新奇的细节设置都对孩子有着极大的吸引力。', '1', null, '8', 'https://img1.doubanio.com/lpic/s24549957.jpg', null, '10004', '9.3', '少年儿童出版社', '2005-4', '猜猜我有多爱你', '温暖', '儿童文学', null, null, null, null);
INSERT INTO `book` VALUES ('10005', '夏洛的网', '] E·B·怀特 ', null, '1', '1', null, '0', '一个蜘蛛和小猪的故事，写给孩子，也写给大人。\r\n\r\n在朱克曼家的谷仓里，快乐地生活着一群动物，其中小猪威尔伯和蜘蛛夏洛建立了最真挚的友谊。然而，一个最丑恶的消息打破了谷仓的平静：威尔伯未来的命运竟是成为熏肉火腿。作为一只猪，悲痛绝望的威尔伯似乎只能接受任人宰割的命运了，然而，看似渺小的夏洛却说：“我救你。”于是，夏洛用自己的丝在猪栏上织出了被人类视为奇迹的网上文字，彻底逆转了威尔伯的命运，终于让它在集市的大赛中赢得特别奖，和一个安享天命的未来。但，这时，蜘蛛夏洛的生命却走到了尽头……', '1', null, '6', 'https://img1.doubanio.com/lpic/s1120437.jpg', null, '10005', '8.5', '上海译文出版社', '2004-5', '童话', '夏洛的网', '儿童文学', null, null, null, null);
INSERT INTO `book` VALUES ('10006', '巨人的陨落', '[英] 肯·福莱特', null, '1', '2', null, '0', '在第一次世界大战的硝烟中，每一个迈向死亡的生命都在热烈地生长——威尔士的矿工少年、刚失恋的美国法律系大学生、穷困潦倒的俄国兄弟、富有英俊的英格兰伯爵，以及痴情的德国特工… 从充满灰尘和危险的煤矿到闪闪发光的皇室宫殿，从代表着权力的走廊到爱恨纠缠的卧室，五个家族迥然不同又纠葛不断的命运逐渐揭晓，波澜壮阔地展现了一个我们自认为了解，但从未如此真切感受过的20世纪。', '1', null, '11', 'https://img3.doubanio.com/mpic/s28668834.jpg', null, 'gg', '8.9', '江苏凤凰文艺出版社', '2016-5-1', '历史', '小说', '外国文学', null, null, null, null);
INSERT INTO `book` VALUES ('10007', '认识电影 （全彩插图第12版）', '[美] 路易斯·贾内梯', null, '1', '3', null, '0', '全球畅销40余年，历经12次修订的电影入门书\n著名学者焦雄屏潜心增修校译, 中文世界新版首发！\n精编精校，高度还原版式重排，全彩精装版！\n...................\n※编辑推荐※\n《认识电影》一书诞生于20世纪70年代，历经四十余年的洗礼，已成为百余所世界名 校电影概论、影视制作、电影美学等专业的经典教材和必读书目，并被翻译成多国语言在世界范围内广为流行。书中提供了各种认识电影的角度，帮助读者了解电影是怎样以一种复杂的语言进行表达和传播的；同时，通过剖析大量影片实例，结合众多剧照来解释电影创作过程，使学电影变得更为生动有趣。\n作者路易斯·贾内梯教授不断更新再版、修订内容、添加新近电影剧照及案例，使本书一直与时代趋势同步。此次借着英文第12版修订面世，特别邀请焦雄屏老师更订译文，并随之重编重排，推出全彩精装版，更完美地呈现这本图文并茂的经典教材的全貌，以飨各位读者。\n☆ 自出版以来全球畅销四十余年，历经12次修订，是当今世界发行量、流传度皆高居榜首的电影入门书。在英、德、加、澳、南非等地广受欢迎，并被译成日、韩、希伯来等多种语言。\n☆ 哈佛大学、MIT、纽约大学、北京大学、北京电影学院、台湾大学等众多世界知名院校影视课程指定教材，培生教育集团全球畅销的教材之一。\n☆ 集电影概论和电影赏析于一体。全书搜集超过四百张珍贵剧照，涵盖影史经典之作和近年卖座佳片，第12版特别增加了下列案例：（1）对当下电影类型进行补充，如动画片《料理鼠王》《我在伊朗长大》、CG电影《贝奥武夫》；（2）通过现代喜剧片拓展讨论电影的娱乐属性，如《朱诺》《太坏了》《热带惊雷》；（3）更新科幻片、动作片、歌舞片、政治电影案例，如《科洛弗档案》《变形金刚》《钢铁侠》《理发师托德》《反恐疑云》；（4）探讨新近非美影片，如《潘神的迷宫》《女王》《贫民窟的百万富翁》《满城尽带黄金甲》。\n☆ 提供精准而成熟的电影分析技巧，批露当今最热明星的独家新闻（关于投身社会公益活动的演员如安吉丽娜·朱莉、布拉德·皮特、乔治·克鲁尼），探讨高票房电影的市场策略，展现电影技术前沿动向，反映电影产业发展趋势。\n☆翻译权威可靠，译文流畅优美，著名电影人焦雄屏特别为第12版重新增订译文。\n...................\n※内容简介※\n《认识电影》是电影入门书中的经典之作，问世四十多年来，始终是世界各地影视从业人员和主流专业院校的必备之选，更是电影爱好者不可或缺的手边书。面对电影中复杂的语言系统、构成要素、表意手段，作者划分了现实主义、形式主义两大阵营，用深入浅出、简明扼要的笔触，引出了电影作为艺术、作为工业、作为意识形态等方方面面。\n书中穿插以数百幅精美剧照和精辟说明，如美国的史蒂文·斯皮尔伯格、英国的迈克·李、伊朗的阿巴斯以及中国的李安等著名导演的杰作，组成了一道全球电影人的经验光谱。此次修订的第12版，增加了对动画片、喜剧片、科幻片、歌舞片、CG电影的评述，经过精校重排和全书彩印，呈现出更贴近英文原版的风貌。\n...................\n※名人推荐※\n近二十年来，在任何华人电影人的书架上，总会看到此书的踪影，足见它对电影的制作也发生了一定的影响。\n——焦雄屏　电影监制，台北艺术大学电影研究所教授', '1', null, '5', 'https://img1.doubanio.com/mpic/s28946557.jpg', null, 'rrrr', '9.4', '北京联合出版公司·后浪出版公司', '2016-9', '电影', '电影理论', '艺术', null, null, null, null);
INSERT INTO `book` VALUES ('10008', 'Java就业培训教程', '张孝祥', null, '1', '2', null, '0', '《Java 就业培训教程》全书共分11章。第1章详细地讲解了Java开发环境的搭建、反编译工具的使用、JDK文档资料的查阅以及Java程序的编译和运行过程。第2章系统地讲解了Java的一些常用语法，在讲解语法的过程中，作者把常见问题进行了正反对比，分析了问题产生的根源，旨在加深印象。在第3章和第4章中，透彻系统地讲解了面向对象的思想和应用，用通俗形象的语言、典型翔实的例子、鲜明的对照比较，阐述了初学者最容易迷惑的一些思想理念。在以后的章节中，作者始终以“启发编程思想，培养编程感觉”为指导，以剖析典型实例、分析源码结构含义、解析常见问题等方式，从高屋建瓴的角度，用通俗易懂的文字，讲解了多线程、常用Java类、Java中的I/O（输入输出）编程、GUI与Applet、网络编程等方面的知识。 作者长期工作在开发与教学的第一线，既考虑了在实际开发中经常遇到的难题，也分析了众多学员在学习中经常困惑的问题。', '1', null, '3', 'https://img3.doubanio.com/mpic/s5692531.jpg', null, '33333', '8.5', '清华大学出版社', '2003-9', 'Java', '张孝祥', '编程', null, null, null, null);
INSERT INTO `book` VALUES ('10009', '高等数学（上册）', '同济大学数学系', null, '1', '1', null, '0', '本书是同济大学数学系编《高等数学》的第六版，依据最新的“工科类本科数学基础课程教学基本要求”，为高等院校工科类各专业学生修订而成。\n本次修订时对教材的深广度进行了适度的调整，使学习本课程的学生都能达到合格的要求，并设置部分带*号的内容以适应分层次教学的需要；吸收国内外优秀教材的优点对习题的类型和数量进行了凋整和充实，以帮助学生提高数学素养、培养创新意识、掌握运用数学工具去解决实际问题的能力；对书中内容进一步锤炼和调整，将微分方程作为一元函数微积分的应用移到上册，更有利于学生的学习与掌握。\n本书分上、下两册出版，上册包括函数与极限、导数与微分、微分中值定理与导数的应用、不定积分、定积分及其应用、微分方程等内容，书末还附有二、三阶行列式简介、几种常用的曲、积分表、习题答案与提示。', '1', null, '2', 'https://img1.doubanio.com/mpic/s10403728.jpg', null, '126', '7.8', '高等教育出版社', '2007-04-01', '高等数学', '数学', '教材', null, null, null, null);
INSERT INTO `book` VALUES ('10010', 'Java程序员面试笔试宝典', '何昊,薛鹏,叶向阳', '', '1', '4', null, '0', '《Java程序员面试笔试宝典》引入了一批来自于名牌高校、就职于明星企业的职场达人的真实求职案例，通过他们的求职经验与教训，抛砖引玉，将整个求职过程生动形象地展示在读者面前，进而对求职者起到一定的指引作用。同时，为了更具说服力，书中特邀多位IT名企面试官现身说法，以独到的视角对面试过程中求职者存在的各类问题进行了深度剖析。为了能够让读者对即将投身的工作有一份更加清楚的认识，能够更加有针对性地进行求职准备，《Java程序员面试笔试宝典》对各种类型的IT企业的招聘环节进行了庖丁解牛式的分析。不仅如此，书中还特别针对当前各大IT企业面试笔试中常见的问题以及注意事项，进行了深层次的分析。技术性知识的考核是程序员求职中最重要的内容，鉴于此，《Java程序员面试笔试宝典》除了对传统的计算机相关知识（Java语言基础知识、Web基础知识、数据结构与算法、操作系统、计算机网络与通信、数据库、设计模式等）以及面试笔试真题进行分析与解答外，还根据当前计算机技术的发展潮流，对面试笔试中常见的海量数据处理进行了详细地分析。\n《Java程序员面试笔试宝典》是一本计算机相关专业毕业生面试笔试的求职用书，同时也适合期望在计算机软硬件行业大显身手的计算机爱好者阅读。', '1', null, '4', 'https://img1.doubanio.com/mpic/s28043448.jpg', null, '2323', '7.0', '机械工业出版社', '2014-9-1', '面试', '程序员面试笔试宝典', '程序员', '', '', '', null);
INSERT INTO `book` VALUES ('10011', '国富论', '[英] 亚当·斯密', '', '1', '2', null, '0', '亚当·斯密并不是经济学说的最早开拓者，他最著名的思想中有许多也并非新颖独特，但是他首次提出了全面系统的经济学说，为该领域的发展打下了良好的基础。因此完全可以说《国富论》是现代政治经济学研究的起点。\n《国富论》远远不是一部通常所认为的学术论文。虽然斯密也劝说放任自由，但他的论证却更多地是反对政府干预和反对垄断；虽然他赞扬贪欲的结果，却又几乎总是鄙视商人的行为和策略。他也不认为商业制度本身是完全值得赞美的。', '1', null, '12', 'https://img3.doubanio.com/mpic/s2164670.jpg', null, '130', '9.0', '华夏出版社', '2005-1', '经济学', '国富论', '亚当・斯密', '', '', '', null);
INSERT INTO `book` VALUES ('10012', 'Java程序员面试笔试宝典', '何昊,薛鹏,叶向阳', '', '1', '3', null, '0', '《Java程序员面试笔试宝典》引入了一批来自于名牌高校、就职于明星企业的职场达人的真实求职案例，通过他们的求职经验与教训，抛砖引玉，将整个求职过程生动形象地展示在读者面前，进而对求职者起到一定的指引作用。同时，为了更具说服力，书中特邀多位IT名企面试官现身说法，以独到的视角对面试过程中求职者存在的各类问题进行了深度剖析。为了能够让读者对即将投身的工作有一份更加清楚的认识，能够更加有针对性地进行求职准备，《Java程序员面试笔试宝典》对各种类型的IT企业的招聘环节进行了庖丁解牛式的分析。不仅如此，书中还特别针对当前各大IT企业面试笔试中常见的问题以及注意事项，进行了深层次的分析。技术性知识的考核是程序员求职中最重要的内容，鉴于此，《Java程序员面试笔试宝典》除了对传统的计算机相关知识（Java语言基础知识、Web基础知识、数据结构与算法、操作系统、计算机网络与通信、数据库、设计模式等）以及面试笔试真题进行分析与解答外，还根据当前计算机技术的发展潮流，对面试笔试中常见的海量数据处理进行了详细地分析。\n《Java程序员面试笔试宝典》是一本计算机相关专业毕业生面试笔试的求职用书，同时也适合期望在计算机软硬件行业大显身手的计算机爱好者阅读。', '1', null, '2', 'https://img1.doubanio.com/mpic/s28043448.jpg', null, '1130', '7.0', '机械工业出版社', '2014-9-1', '面试', '程序员面试笔试宝典', '程序员', '', '', '', null);
INSERT INTO `book` VALUES ('10013', 'Java编程思想', '[美] Bruce Eckel', null, '1', '2', null, '0', '本书赢得了全球程序员的广泛赞誉，即使是最晦涩的概念，在Bruce Eckel的文字亲和力和小而直接的编程示例面前也会化解于无形。从Java的基础语法到最高级特性（深入的面向对象概念、多线程、自动项目构建、单元测试和调试等），本书都能逐步指导你轻松掌握。\n从本书获得的各项大奖以及来自世界各地的读者评论中，不难看出这是一本经典之作。本书的作者拥有多年教学经验，对C、C++以及Java语言都有独到、深入的见解，以通俗易懂及小而直接的示例解释了一个个晦涩抽象的概念。本书共22章，包括操作符、控制执行流程、访问权限控制、复用类、多态、接口、通过异常处理错误、字符串、泛型、数组、容器深入研究、Java I/O系统、枚举类型、并发以及图形化用户界面等内容。这些丰富的内容，包含了Java语言基础语法以及高级特性，适合各个层次的Java程序员阅读，同时也是高等院校讲授面向对象程序设计语言以及Java语言的绝佳教材和参考书。', '1', null, '3', 'https://img1.doubanio.com/mpic/s1320039.jpg', null, '138', '9.0', '机械工业出版社', '2005-9', 'java', '编程', 'java编程思想', null, null, null, null);
INSERT INTO `book` VALUES ('10014', 'Java与模式', '阎宏,编著', null, '1', '1', null, '0', '《Java与模式》是一本讲解设计原则以及最为常见的设计模式的实用教材，目的是为了工作繁忙的Java系统设计师提供一个快速而准确的设计原则和设计模式的辅导。全书分为55章，第一个章节讲解一个编编程模式，说明此模式的用意、结构，以及这一模式适合于什么样的情况等。每一个章节都附有多个例子和练习题，研习这些例子、完成这些练习题可以帮助读者更好地理解所讲的内容。大多数的章节都是相对独立的，读者可以从任何一章开始读起。为了满足不同程序的读者的需要，书中提供了一些标为“专题”的章节，不阅读这些章节，对阅读书中的标准章节没有影响。', '1', null, '9', 'https://img3.doubanio.com/mpic/s1201195.jpg', null, '147', '7.9', '电子工业出版社', '2002-10', '设计模式', 'java', 'Java与模式', null, null, null, null);
INSERT INTO `book` VALUES ('10015', '物理学', '东南大学　等同马文蔚　等', null, '1', '3', null, '0', '本书是在《物理学》(第四版)基础上，参照教育部非物理类专业物理基础课程教学指导分委员会新制订的《理工科非物理类专业大学物理课程教学基本要求(讨论稿)》修订而成的，书中涵盖了基本要求中所有的核心内容，并选取了一定数量的扩展内容，供不同专业选用。在修订过程中，本书保持原书体系合理，深广度适当，分量适中，适应面宽等特点，同时加强了近代物理的内容，增强用现代观点来诠释经典物理，以及近代物理的成就对科学技术的影响。    本书为上、下两册，上册包括力学和电磁学，下册包括振动和波动、光学、分子动理论和热力学基础、相对论、量子物理等。与本书相配套的还有多媒体《物理学(第五版)电子教案》、《物理学原理在工程技术中的应用》(第三版)、《物理学(第五版)习题分析与解答》和《物理学(第五版)学习指南》等。    本书可作为高等学校理工科非物理类专业的教材，也可供文理科有关专业选用和社会读者阅读。', '1', null, '1', 'https://img3.doubanio.com/mpic/s26239641.jpg', null, '141', '7.0', '高等教育', '2006-3', '物理', '东南大学', '教材', null, null, null, null);
INSERT INTO `book` VALUES ('10016', '计算机组成原理', '唐朔飞', null, '1', '2', null, '0', '《面向21世纪课程教材•普通高等教育\"十一五\"国家级规划教材:计算机组成原理(第2版)》内容简介：为了紧跟国际上计算机技术的新发展，《面向21世纪课程教材•普通高等教育\"十一五\"国家级规划教材:计算机组成原理(第2版)》对第1版各章节的内容进行了补充和修改，并增加了例题分析，以加深对各知识点的理解和掌握。《面向21世纪课程教材•普通高等教育\"十一五\"国家级规划教材:计算机组成原理(第2版)》通过对一台实际计算机的剖析，使读者更深入地理解总线是如何将计算机各大部件互连成整机的。', '1', null, '8', 'https://img3.doubanio.com/mpic/s4411273.jpg', null, '128', '7.4', '高等教育出版社', '2008-1', '计算机', '计算机组成原理', '考研', null, null, null, null);
INSERT INTO `book` VALUES ('10017', '计算机网络', '谢希仁', null, '1', '2', null, '0', '本书自1989年首次出版以来，于1994年、1999年、2003年、2008年分别出了修订版，2006年8月被纳入普通高等教育“十一五”国家级规划教材，现在正在申报普通高等教育“十二五”国家级规划教材。本次修订版在内容和结构方面都有很大的修改。    全书分为10章，比较全面系统地介绍了计算机网络的发展和原理体系结构、物理层、数据链路层、网络层、运输层、应用层、网络安全、因特网上的音频/视频服务、无线网络和下一代因特网等内容。', '1', null, '9', 'https://img3.doubanio.com/mpic/s27389271.jpg', null, '139', '7.6', '电子工业出版社', '2013-6-1', '计算机网络', '计算机', '教材', null, null, null, null);
INSERT INTO `book` VALUES ('10018', '中国近现代史纲要（2013年修订版）', '教材编写课题组', null, '1', '1', null, '0', '中国的近现代史，是指1840年以来中国的历史。其中从1840年鸦片战争爆发到1949年中华人民共和国成立前夕的历史，是中国的近代史；1949年中华人民共和国成立以来的历史，是中国的现代史。\n“中国近现代史纲要”是全国高等学校本科生必修的思想政治理论课之一。通过本课程的学习，应当达到什么目的呢？主要是要认识近现代中国发展和革命、建设、改革的历史进程及其内在的规律性，了解国史、国情，深刻领会历史和人民是怎样选择了马克思主义，选择了中国共产党，选择了社会主义道路，选择了改革开放。', '1', null, '2', 'https://img1.doubanio.com/mpic/s27423288.jpg', null, '144', '5.2', '高等教育出版社', '2007-2', '教材', '教科书', '很好', null, null, null, null);
INSERT INTO `book` VALUES ('10019', '数据库系统教程', '施伯乐,丁宝康,汪卫', null, '1', '3', null, '0', '《普通高等教育十一五国家级规划教材•数据库系统教程》第1版列为教育部“面向21世纪课程教材”。第2版作了较大的修改和补充，增加了关系逻辑、递归SQL、对象联系图、UML的类图、ODMG标准、ODBC和XML等内容。这次第3版被教育部列为普通高等教育“十一五”国家级规划教材，对内容又作了修订和充实。《普通高等教育十一五国家级规划教材•数据库系统教程》详细介绍数据库系统的基本原理、方法和发展趋势。分为上、下两篇。上篇为基础篇，介绍传统的数据库技术，内容包括：数据库概论、关系模型和关系运算理论、关系数据库语言SQL、关系数据库的规范化设计、数据库设计与ER模型、数据库的存储结构和系统实现技术。下篇为发展篇，介绍数据库技术的发展，内容包括：对象数据库系统、分布式数据库系统、ODBC技术、XML技术和现代信息集成技术。', '1', null, '7', 'https://img3.doubanio.com/mpic/s4525416.jpg', null, '135', '6.2', '四川少年儿童出版社', '2008-6', '数据库', '教材', '计算机科学', null, null, null, null);
INSERT INTO `book` VALUES ('10020', '当世界年纪还小的时候', '[德] 于尔克·舒比格 著 / [德] 罗特劳特·苏珊娜·贝尔纳 图 ', null, '1', '4', null, '0', '天堂是这样一个世界——也就是当她还小的时候的那个世界。随着时间的流逝，一切都改变了。\r\n\r\n接下来的其实是大家所熟知的，但是舒比格让人惊喜、充满童话色彩的故事是不会让你提前猜到结局的，要耐心等待。我们在那些简单又神秘的事物中发现故事，比如：动物是从哪里得到名字的；怎样才能获得帮助和幸福。\r\n\r\n谁读这本书都会惊叹，因为在书中藏满了美丽的灵感。', '1', null, '1', 'https://img1.doubanio.com/lpic/s1886517.jpg', null, '10020', '8.6', '四川少年儿童出版社', '2006-10', '绘本', '德国', '儿童文学', null, null, null, null);
INSERT INTO `book` VALUES ('10021', '天蓝色的彼岸', '] 希尔 ', null, '1', '3', null, '0', '这是一部感人至深，触动灵魂的人性寓言。\r\n\r\n小男孩哈利因车祸去了另一个世界。在那里它他加入了等待去天蓝色彼岸的队伍。但他还挂念着爸爸，妈妈，姐姐和同学们，却又不知如何传达他的心声，直到他碰到一个叫阿瑟的幽灵。阿瑟带着哈里偷偷溜回人间，来向亲人和朋友告别, 向他们表示歉意和深深的爱… …\r\n\r\n这是一本最适合在我们这个年代看的书。单纯，清新，温暖的文字，教会人们学会关爱，珍惜生命，唤起人们内心深处最美好的情感，呈送各人们最真切的感动和最伟大的爱。在不可抵挡中的人性光辉中感悟生命和死亡… …\r\n\r\n本书适合九岁以上所有人群阅读，他是呈送给所有善良心灵最好的礼物。本书被翻译成几十种文字，在欧美和日本广为流传，感动了世界各地无数的读者。本书得到了联合国教科文组织的推荐，并被誉为“21世纪最伟大的人性寓言”。（泰晤士报）', '1', null, '12', 'https://img1.doubanio.com/lpic/s2414747.jpg', null, '10021', '8.5', '新世界出版社', '2003-12', '天蓝色的彼岸', '童话', '死亡', null, null, null, null);
INSERT INTO `book` VALUES ('10022', '牧羊少年奇幻之旅', '[巴西] 保罗·柯艾略 ', null, '1', '2', null, '0', '牧羊少年圣地亚哥接连两次做了同一个梦，梦见埃及金字塔附近藏有一批宝藏。少年卖掉羊群，历尽千辛万苦一路向南，跨海来到非洲，穿越“死亡之海”撒哈拉大沙漠……期间奇遇不断，在一位炼金术士的指引下，他终于到达金字塔前，悟出了宝藏的真正所在……', '1', null, '1', 'https://img1.doubanio.com/lpic/s3668327.jpg', null, null, '8.6', '南海出版公司', '2009-3-1', '牧羊少年奇幻之旅', '保罗柯艾略', '与心沟通', null, null, null, null);
INSERT INTO `book` VALUES ('10023', 'Selenium自动化测试指南', '[\"赵卓\"]', '1111', '1', '2', null, '0', 'Selenium的特性突出，应用前景看好。相关书籍较少，存在市场空白。\n整理了所有个人经验及其他人在Selenium实用过程中的经验，对一些疑难问题进行说明。在作者所在公司的推广和培训中，得到同事的好评。很有实践指导效果和出版价值。', '1', null, '9', 'https://img1.doubanio.com/mpic/s27196477.jpg', null, null, '5.9', '', '2013-9', 'selenium', '自动化测试', '软件测试', 'lynn', null, 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '2018-01-31 14:41:31');
INSERT INTO `book` VALUES ('10063', '失物之书', '[\"[爱尔兰] 约翰·康诺利\"]', '', '1', '2', null, '0', '二战时，男孩戴维的妈妈得了重病。他强迫自己执行一套规定，因为他相信妈妈的命运跟他的行为联系在一起：单数糟，双数好，所以他无论做什么都要双数……尽管他小心翼翼，可妈妈还是弃他而去。丧母的悲伤和痛楚，使戴维不能自已。父亲再婚所带来的惊愕和冲击，对继母及新生儿弟弟的嫉妒与憎恶…深深的幽怨在戴维的身边织就一个幻灵的诡境，他听见了书在说话。从小就和妈妈一起阅读的童话故事，迥异于常的白雪公主、小红帽、骑士罗兰……从黑夜里、从林地里召唤戴维，呼唤他进入一个充满残酷、血腥、征伐的险境。在那里，一切如同真实的人生道路，充满了险恶和重重难关。惟有不逃避、惟有肯原谅，惟有找到神奇国度里那本被遗忘的《失物之书》，戴维才能得到新生。', '1', null, '2', 'https://img3.doubanio.com/mpic/s3668145.jpg', null, null, '8.5', '人民文学出版社', '2009-4', '爱尔兰', '约翰·康诺利', '成人童话', '', null, '', '');
INSERT INTO `book` VALUES ('10064', '爱德华的奇妙之旅', '[\"[美] 凯特·迪卡米洛\",\"[美]马格拉姆·伊巴图林/绘\"]', 'null', '1', '2', null, '0', '从前，在埃及街旁的一所房子里，住着一只名叫爱德华·图雷恩的瓷兔子。那小兔子很是自鸣得意，而且理由充足：他为一个名叫阿比林的女孩儿所拥有，她对他关怀备至，崇敬有加。\n可是后来，有一天，他被丢失了。\n凯特·迪卡米洛把我们带上了一段异乎寻常的旅程——从海洋深处到渔夫的渔网，从垃圾堆的顶部到流浪汉营地的篝火边，从一个生病的孩子的床前到孟斐斯的街道上……一路上的见闻令我们惊愕不已——即使是一颗极易破碎的心也可以失去爱、学会爱而又重新得到爱。\n本书荣获2006年波士顿全球号角书奖金奖。', '1', null, '8', 'https://img3.doubanio.com/mpic/s24973480.jpg', null, null, '8.7', '新蕾出版社', '2007', '爱德华的奇妙之旅', '童话', '儿童文学', 'null', null, 'null', 'null');
INSERT INTO `book` VALUES ('10065', '彼得·潘', '[\"[英] 詹姆斯·巴里\",\"孙国双 图\"]', 'null', '1', '2', null, '0', '彼得·潘，满口珍珠般的乳牙，穿一身用树叶和树浆做的衣服，一个不愿长大也永远不会长大的可爱的小男孩。\n因为害怕长大，他在出生的第一天，就从家里逃了出来，常去伦敦的肯辛顿公园游荡：如今长住在一个叫“乌有岛”的海岛上，成为一群被大人丢失的孩子们的队长。在一个夏夜里，彼得·潘飞到伦敦，趁达林太太不在家，诱使她的小女孩温迪带着两个小弟弟跟他飞回乌有岛。大家推举温迪做母亲，从此过上了童话般奇妙的生活。他们一起做了许多英勇的事，包括一次被掠一了海盗船，彼得·潘与诡计多端的海盗头子胡克决一死战，使他掉进了鳄鱼的口中……\n《彼得·潘》将荒诞幻想、仙人故事、惊险情节，运用性格刻划、心理描写、讽刺和幽默等手段纺织在一个小小的故事里。它既像一场令人眼花缭乱的马戏，又像一首狂想曲，给读者以强烈的震撼力。', '1', null, '3', 'https://img3.doubanio.com/mpic/s1000715.jpg', null, null, '8.8', '哈尔滨出版社', '2003-7', '彼得・潘', '童话', '儿童文学', 'null', null, 'null', 'null');
INSERT INTO `book` VALUES ('10066', '安吉拉·卡特的精怪故事集', '[\"[英] 安吉拉·卡特\"]', 'null', '1', '2', null, '0', '很久很久以前，精怪故事不光是给孩子们看的，《安吉拉·卡特的精怪故事集》就是如此。这部精彩的集子囊括了抒情故事、血腥故事、令人捧腹的故事和粗俗下流的故事，它们来自世界各地，从北极到亚洲——里面决没有昏头昏脑的公主和多愁善感的仙子；相反，我们看到的是美丽的女仆和干瘪的老太婆，狡猾的妇人和品行不端的姑娘，巫婆和接生婆，坏姨妈和怪姐妹。\n这些出色的故事颂扬坚强的意志、卑鄙的欺诈、妖术与阴谋，采集它们的只可能是独一无二且令我们深深怀念的安吉拉·卡特。\n最初以《悍妇精怪故事集》和《悍妇精怪故事集第二卷》的形式出版', '1', null, '3', 'https://img1.doubanio.com/mpic/s6870889.jpg', null, null, '8.0', '南京大学出版社', '2011-9', '安吉拉·卡特', '幻想', '英国', 'null', null, 'null', 'null');
INSERT INTO `book` VALUES ('10067', '银河铁道之夜', '[\"(日)宫泽贤治\"]', 'null', '1', '2', null, '0', '《银河铁道之夜:宫泽贤治童话》精选了宫泽贤治的部分经典童话，从中你可以品到这位世界级童话大师的绝代风采。一列闪烁着天光的银河铁道列车拔地而起，飞过一片片熠熠燃烧的天火，飞过被钻石、露水和所有美丽东西的灿烂光芒所照亮的银河的河床，驶向璀璨神秘的银河。惟有命定的乘客及有缘人才得以搭乘，得以见识另一种生命的去途，得以窥见生与死的奥秘……', '1', null, '6', 'https://img1.doubanio.com/mpic/s1785279.jpg', null, null, '8.6', '青岛出版社', '2006', '宫泽贤治', '童话', '日本', 'null', null, 'null', 'null');
INSERT INTO `book` VALUES ('10068', '格林童话全集', '[\"格林兄弟\"]', 'null', '1', '2', null, '0', '《格林童话全集》主要内容：本文库旨在汇总世界文学创作的精华，全面反映包括我国在内的世界文学的最高成就，为读者提供世界第一流的文学精品，它以最能代表一个时代文学成就的长篇小说为骨干，同时全面地反映其他体裁如中短篇小说、诗歌、散文、戏剧、童话、寓言等各主面最优秀的成查，选收作品的时限，外国文学部分，自古代英雄史诗至第二次世界大战结束，中国文学部分，自《诗经》至中华人民共和国成立，它是包容古今、囊括中外的珍贵的文学图书系统。', '1', null, '8', 'https://img3.doubanio.com/mpic/s1134341.jpg', null, null, '8.9', '人民文学出版社', '1994-11', '童话', '格林童话', '外国文学', 'null', null, 'null', 'null');
INSERT INTO `book` VALUES ('10069', '小毛驴与我', '[\"[西] 希梅内斯\"]', 'null', '1', '2', null, '0', '《小毛驴与我》是西班牙诺贝尔文学奖得主希梅内斯写下的关于自己与心爱的小毛驴普儿唇齿相依的散文集。全书共100多个短篇，每篇文章短小、简洁，干净典雅的文字，充满诗意的忧郁，散发出淡淡的哀愁，以孩子天真的口吻道出现实的不完美，字里行间洋溢着爱和温情。在作者眼中，小毛驴普儿充满灵性，高贵、善良。作者对它的情感有热望，有憧憬，有担忧，有苦涩，有甜蜜，把自己与一头小毛驴的一生情谊写得令人动容。书中配有原版书的珍贵插图，诙谐逼真，趣味盎然。', '1', null, '6', 'https://img3.doubanio.com/mpic/s8856512.jpg', null, null, '8.6', '青岛出版社', '2011-11', '西班牙', '童话', '希梅内斯', 'null', null, 'null', 'null');
INSERT INTO `book` VALUES ('10070', '狐狸的窗户', '[\"(日)安房直子 文\",\"(日)织茂恭子 绘\"]', 'null', '1', '2', null, '0', '《狐狸的窗户》内容简介：当小狐狸用被桔梗花的花汁染蓝的手指搭起一扇小窗，窗子里出现一只美丽的雌白狐狸时，它对青年说：“这是我的妈妈。”“……”“很久以前，她被‘砰’地一声打死了。”\n“‘砰’地一声，是枪吗？”\n“对，就是枪！”\n小狐狸没有说是谁“砰”地一枪杀死了它的妈妈，安房商子也没有点破，故事里留下了一个不大不小的谜。但我猜，应该就是这个青年吧？这附近，只有他一个猎人住在山小屋里，他扛着枪不说，当他看见小狐狸的一刹那，竟会残忍地想：“要是‘砰’地一枪，准能打中。不过，我还是想找到狐狸窝，将窝里的老狐狸一起捉住。”可是，小狐狸却宽恕了他，也许善良的小狐狸根本就不知道什么叫仇恨，孤身一人的它，只是想和孤身一人的青年共同分享这个桔梗花教给它的魔法吧！', '1', null, '6', 'https://img3.doubanio.com/mpic/s4118483.jpg', null, null, '9.5', '二十一世纪出版社', '2009-8', '安房直子', '童话', '日本', 'null', null, 'null', 'null');
INSERT INTO `book` VALUES ('10071', '七夜物语', '[日] 川上弘美', 'null', '1', '2', null, '0', '一本成长与失落之书。\n李长声、清泉浅井、蓝蓝、黎戈、顾湘、胡桑、胡续冬、范晔、骆以军 联名推荐！\n————————\n这是一本关于童年的书，作者细致温柔地讲述了小夜小时候一段不寻常的经历。\n在这个故事中，小学四年级的鸣海小夜和妈妈生活在一起。\n自从父母离异后，她就再也没有见过爸爸。\n一天，她 在区图 书馆看到了一本不可思议 的书，名字叫做《七夜物语》。\n小夜和同班同学仄田开 始阅 读这本 书 ，并被卷入书中的夜晚世界 ！\n于是，他们平凡的小学生生活出现了种种神奇的遭遇。\n与大老鼠格力克莱尔的相遇，困意的诱惑，年轻时候的父母、美丽可爱的孩子们、刚出生的铅笔、光与影的战斗……\n七个夜晚的的冒险，又将如何改变他们各自的命运？\n本书是芥川奖获奖作家川上弘美第一部给孩子们的魔幻作品。\n更是一部带我们探寻与治愈童年的孤独与忧伤的书。\n————————\n编辑推荐\n喜欢看童话，是因为心里还住着一个小孩子。\n我们所经历过的种种痛苦与幸福，在童年都能找到源头。\n小时候就是这样，虽然很孤独，却仍期待奇迹发生。\n童年的世界并不如我们所想象的那样风平浪静，只不过一长大的我们就忘记了。\n七个夜晚的冒险让我们回到自己的小时候，更多地了解自己的童年，意味着更好地成长，成长为更好的人。\n适合年龄9到99岁的人群。你和你的孩子都会喜欢的一本书。\n————————\n日亚读者评论\n虽然内容像是给孩子读的童话一样，但成年人读起来也很有趣，很有川上弘美老师的风格，很安心愉快地跟着故事进行了一次冒险之旅。\n喜欢读书的女儿从小学的图书室借来读了一遍，深受感动，又从中学的图书室借来再读了一遍，后来终于开口说自己也想要一本放在身边，我就满足了她的愿望。这本书不仅仅是情节有趣，更重要的是能发人深思。虽然是本儿童书，但是无论年龄多大读起来都很有趣。\n这本书在《朝日新闻》连载的时候我就读得入迷了。书中的风景很像如今已经40多岁的我小时候的情景，感觉很让人怀念。一直想着出了文库本一定要买，望穿秋水终于等到了。现在上初三的儿子一口气看完之后也说“太有意思了”。内心纯净的人一定都会喜欢这本书的。', '1', null, '5', 'https://img3.doubanio.com/mpic/s29350954.jpg', null, null, '7.7', '东方出版社', '2017-3', '日本文学', '童话', '治愈', 'null', null, 'null', 'null');
INSERT INTO `book` VALUES ('10072', '柳林风声', '[英] 肯尼斯·格雷厄姆 著,[澳] 罗伯特·英潘 绘', '', '1', '2', null, '0', '这是一个爸爸写给儿子的童话，是一个适合围坐在暖暖的火炉边，大家一起听的故事。\n书中以细腻典雅的笔调描绘了大自然风光的诗意变化，被誉为“英文散文体作品的典范”，而萦绕在柳林间的那一份友谊与温情，更是让人如沐春风。\n鼹鼠丢下家里的大扫除，钻出地洞，兴高采烈地扑向外面清新的空气。不久，他就和他的几位朋友——懒散自在的兔子、行为粗鲁却为人和善的獾，以及自鸣得意且不负责任的癞蛤蟆——一起踏上了一段刺激、惊险的冒险之旅。在冲动的癞蛤蟆先生的率领下，这几个好朋友一次又一次，奋不顾身地投身于各种历险之中：从搅乱吉普赛车队到偷窃摩托车，再到后面大胆的越狱行径，最终，千锤百炼后的他们终于能像英雄那样，勇敢地直面外面大千世界中那些心思歹毒，阴险狡诈的各色人物。\n这个趣味性十足的童话故事自问世之日起就一直深受读者们的喜爱，与此同时，它也是英国历史上最受欢迎的儿童文学作品之一。肯尼斯?格雷厄姆那精彩绝伦的想象和静谧无声的幽默吸引了无数的孩子和成年人。1908年，《柳林风声》首次出版，时至今日，这本书问世已经整整一百年，而此次的新版正是为了纪念这本书的世纪华诞。', '1', null, '9', 'https://img3.doubanio.com/mpic/s10585083.jpg', null, null, '8.9', '中国城市出版社', '2012-7', '儿童文学', '童话', '英国', '', null, '', '');
INSERT INTO `book` VALUES ('10073', '永远讲不完的故事', '[德] 米切尔·恩德', '', '1', '2', null, '0', '“幻想文学”是当今世界儿童文学的主潮流，它以奇丽诡异的想像、扣人心弦的故事和对人类心灵世界的深切关怀，产生一种让人无法抗拒的艺术魔力，从而让儿童读者乃至成人读者沉浸其中，如醉如痴，不能自拔。 \n\n　　米切尔·恩德创作了许多成功的儿童文学作品，塑造了毛毛、巴斯蒂安等深受孩子们喜爱的女孩、男孩艺术形象，但他本人压根就不承认自己的作品是儿童文学，他甚至根本反对“为了孩子而存在一种特别的文学的说法”。确实，米切尔·恩德的作品孩子们喜欢读，成年人也喜欢读。在一个平凡的没有灵魂的时代，米切尔·恩德以他不朽的作品，挽救了一个几乎要失去的王国，即幻想世界。今天，慕尼黑国际青少年图书馆设有米切尔·恩德纪念馆，全世界的读者永远不会忘记这位不朽的心路开拓者和不倦的寻梦人。\n　　《永远讲不完的故事》是恩德另一部最具有代表性的作品。在德国，它就像《西游记》在中国那样家喻户晓。这部著作给我们讲述了一个令人恨不能一口气读完的故事。小说主人公巴斯蒂安在上学的路上意外地发现一本奇书：《永远讲不完的故事》——幻想王国正在毁灭，天真女皇生命垂危，只有一个人间的小孩为她起一个新的名字，她和幻想王国方能得救。于是巴斯蒂安被拉进故事之中，成了天真女皇和幻想王国的拯救者。这本书大故事中包含着许多小故事，每个小故事既可独立成章，又互相关联；内容既是幻想世界的故事，又是现实世界的故事。其想像之丰富，情节之曲折，篇幅之长，都堪称恩德的巅峰之作。', '1', null, '5', 'https://img1.doubanio.com/mpic/s1989989.jpg', null, null, '9.0', '二十一世纪出版社', '2004-8', '童话', '米切尔·恩德', '儿童文学', '', null, '', '');
INSERT INTO `book` VALUES ('10074', '梦想家彼得', '[英] 伊恩·麦克尤恩', '', '1', '2', null, '0', '这是麦克尤恩写给孩子的第一本书，讲的是一个十岁的小男孩彼得所做的白日梦。在英美两国，《梦想家彼得》都是以带插图的童书形式出版，而在许多别的国家，是以较为严肃的供成年人阅读的形式出版。\n正如作者本人在序言中所说，我们之所以喜欢儿童书，是因为我们的孩子读这些书时的快乐，这跟文学关系少一点，而跟爱关系多一点。麦克尤恩在写作和为他的孩子大声朗读《梦想家彼得》时，他开始觉得忘了伟大的儿童文学传统，为成年人写本关于儿童的书，用的是儿童也能理解的语言，这样也许更好。他希望它的主题——想象力本身——对那些拿起一本书的人来说，都有所参与。', '1', null, '7', 'https://img1.doubanio.com/mpic/s3846187.jpg', null, null, '8.3', '南京大学出版社', '2009-5', '伊恩·麦克尤恩', '童话', '英国', '', null, '', '');
INSERT INTO `book` VALUES ('10075', '风与树的歌', '安房直子', '', '1', '2', null, '0', '安房直子是一个远离尘嚣的女人，她一生淡泊，深居简出，甚至拒绝出门旅行。但她却为我们留下了一山坡野菊花似的短篇幻想小说，如梦如幻，精美至极，犹如一首首空灵隽永的短歌。她总是从一个温柔女性的视点出发，把淡淡的哀愁融入到自己那甘美、诡异的文字当中，写出一个个单纯得近乎透明但却又让人感受生命的怆痛与诗意的故事。', '1', null, '5', 'https://img3.doubanio.com/mpic/s1256733.jpg', null, null, '9.3', '少年儿童出版社', '2004-03-01', '安房直子', '童话', '日本', '', null, '', '');
INSERT INTO `book` VALUES ('10077', '我亲爱的甜橙树', '(巴西)若泽•毛罗•德瓦斯康塞洛斯', '', '1', '2', null, '0', '这是一个构思了42年的故事。\n这是一个仅用12天就写成的故事。\n这是一个让数亿读者感动落泪的故事。\n这是一部有着相当自传性质的儿童小说，作家精确地“摹拟”一个五岁男孩的口吻，记录了一段温馨而伤感的生活片断。五岁的泽泽聪明而早熟，这个天性敏感的男孩，喜欢美国西部电影，喜欢唱歌，总是在自己的“幻想世界”里排遣生活中的不如意和委屈，他甚至发现了一棵“会说话的甜橙树”，每当挨罚的时候他就去找甜橙树聊天……直到有一天，他发现了“这个世界上他最喜欢的人”——老葡。老葡取代了那棵“小甜橙树”，成为他最想念的倾诉对象。他发现，原来现实生活中也能感受到温柔与爱，但是坏消息突然来临：先是因为修路而要砍掉小甜橙树，接着老葡突遇车祸。那个幻想世界中的爱，那个现实生活中的爱，都突然地离开了他。\n“人的心是很大的，放得下我们喜欢的每一样东西。”\n“当你停止喜欢一个人，他就会在你心里慢慢死去。”\n“请把我买走吧，这样家里就会少一个人吃饭……如果觉得贵，也可以分期付款……”\n……\n人们摘录、传抄着人小鬼大的泽泽的经典语录，感悟爱与温柔的真谛。正如台湾80后女导演陈映蓉所说：不管是九岁，十九岁，还是二十九岁，泽泽都会与我同行，给我一样的感动，还有不一样的感悟。', '1', null, '6', 'https://img1.doubanio.com/mpic/s4386309.jpg', null, null, '9.1', '天天出版社', '2010-6', '儿童文学', '巴西', '外国文学', '', null, '', '');
INSERT INTO `book` VALUES ('10078', '毛毛', '米切尔・恩德', '', '1', '2', null, '0', '“毛毛”是一个不知年龄,来自何方的小女孩，她拥有常人所没有的“灵敏听力”，只要她倾听朋友的绝望心声或好友们的吵架声，就能在很自然的情况下，解决他们的问题和纷争。甚至她还能使坏人倾吐他们的阴谋诡计。由于受城市里无处不在的灰先生蒙骗，人们开始醉心于追求所谓合理化、机械的生活，置亲情与良心于不顾，因此毛毛冒着生命危险，见到了时光老人侯拉博士，在时间王国里她发现了世界和人类的大秘密，即“时间就是生命”。生命的诞生即生命的花朵盛开，当生命结束时，又会有同样的生命之花再度绽放……懂得这庄严而神圣的时间秘密的“毛毛”，将回到现实世界勇斗那些灰先生，并终将获得胜利。', '1', null, '3', 'https://img3.doubanio.com/mpic/s1556541.jpg', null, null, '9.1', '二十一世纪出版社', '2000-2-1', '童话', '米切尔·恩德', '儿童文学', '', null, '', '');
INSERT INTO `book` VALUES ('10079', '长袜子皮皮', '[瑞典] 阿斯特丽德·林格伦', '', '1', '2', null, '0', '一位小姑娘一个人住在一栋小房子里，生活完全自理，富得像一位财神，壮得像一匹马，他的爸爸是南海一个岛上的国王。她所做的一切几乎都违背了成年人的意志，不去学校上学，满嘴的瞎话，与警察开玩笑，戏弄流浪汉。但是，她花钱买一大堆糖果，分发给所有的孩子，这就是长袜子皮皮。', '1', null, '1', 'https://img1.doubanio.com/mpic/s1290828.jpg', null, null, '9.0', '中国少年儿童出版社', '1999-3', '童话', '长袜子皮皮', '儿童文学', '', null, '', '');
INSERT INTO `book` VALUES ('10080', '绿山墙的安妮', '[加] 露西·莫德·蒙哥玛利', '', '1', '2', null, '0', '一部最甜蜜的描写儿童生活的小说。安妮是个身世凄凉的小女孩，出生不久即父母双亡，成了孤儿。好心的邻居把她养到六岁之后她又到另一户人家看孩子，后来被送到了孤儿院。十一岁的时候，绿山墙的马修和玛莉拉收养了她。安妮天性活泼乐观，想像力极为丰富。她的天真和幻想使闹了不少笑话，但她的善良和直率也使她赢得了友谊和真挚的爱。她聪明而勤奋，凭着自己的努力考取了大学，但为了照顾玛莉拉，她又放弃了学业。这是一个孤儿长大成人的故事，朴实而绚丽，充满着童心和梦幻。\n绿山墙农舍的卡思伯特兄妹决定领养一个男孩，帮着做田里的农活。令人大吃一惊的是，孤儿院送来了一个爱幻想、喋喋不休的红发孩，一个小精灵。这个小精灵像一股清新的风吹进了闭塞的农舍乡村。故事由此开始……', '1', null, '3', 'https://img1.doubanio.com/mpic/s1050548.jpg', null, null, '9.0', '浙江文艺出版社', '2003-01', '绿山墙的安妮', '儿童文学', '加拿大', '', null, '', '');
INSERT INTO `book` VALUES ('10081', '小兔彼得和他的朋友们（全3册）', '【英】毕翠克丝•波特', '', '1', '2', null, '0', '《小兔彼得和他的朋友们》收录了毕翠克丝•波特的全部作品，包括《小兔彼得的故事》《小松鼠纳特金的故事》《格罗斯特的裁缝》等二十三篇童话和《阿利•达普利的童谣》《塞茜莉•琶丝莉的童谣》《三只小老鼠》《小兔子的圣诞晚会》四篇童谣，其中童话《狡猾的老猫》《狐狸和鹳乌》和童谣《三只小老鼠》《小兔子的圣诞晚会》是作者生前未出版的作品。二十七篇美丽的童话（童谣）各具异趣，字里行间洋溢着友情和爱心的温馨，七百多幅精美的图画逐页插配，相成趣，给人以极大的艺术享受。\n毕翠克丝•波特笔下的小动物们每一个都有自己的个性——淘气而又胆小怕事的小兔彼得，尖酸贪婪的老鼠大胡子塞缪尔，不谙世事而又颇有主张的水鸭杰迈玛，大智若愚、心胸开阔的小猪布兰德……让人看了还想看。自从1902年首次出版以来，“彼得兔”系列故事便赢得了全世界孩子的心，至今已被翻译成三十六种语言，销售量以千万册计，英语国家的孩子们几乎人手一册，被誉为“儿童文学中的《圣经》”。', '1', null, '7', 'https://img1.doubanio.com/mpic/s4042908.jpg', null, null, '9.0', '安徽教育出版社', '2009年10月', '绘本', '童话', '彼得兔绘本全集：小兔彼得和他的朋友们', '', null, '', '');
INSERT INTO `book` VALUES ('10082', 'Selenium自动化测试指南', '赵卓', '11', '1', '2', null, '0', 'Selenium的特性突出，应用前景看好。相关书籍较少，存在市场空白。\n整理了所有个人经验及其他人在Selenium实用过程中的经验，对一些疑难问题进行说明。在作者所在公司的推广和培训中，得到同事的好评。很有实践指导效果和出版价值。', '1', null, '9', 'https://img1.doubanio.com/mpic/s27196477.jpg', null, null, '5.9', '', '2013-9', 'selenium', '自动化测试', '软件测试', 'lynn', null, 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '2018/02/01 13:58:33');
INSERT INTO `book` VALUES ('10083', 'Selenium自动化测试指南', '赵卓', 'ggg', '1', '2', null, '0', 'Selenium的特性突出，应用前景看好。相关书籍较少，存在市场空白。\n整理了所有个人经验及其他人在Selenium实用过程中的经验，对一些疑难问题进行说明。在作者所在公司的推广和培训中，得到同事的好评。很有实践指导效果和出版价值。', '1', null, '6', 'https://img1.doubanio.com/mpic/s27196477.jpg', null, null, '5.9', '', '2013-9', 'selenium', '自动化测试', '软件测试', 'lyng', null, 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '2018/02/01 14:07:48');

-- ----------------------------
-- Table structure for bookclub
-- ----------------------------
DROP TABLE IF EXISTS `bookclub`;
CREATE TABLE `bookclub` (
  `clubid` int(20) NOT NULL AUTO_INCREMENT,
  `openid` int(20) DEFAULT NULL,
  `activeName` varchar(20) DEFAULT NULL,
  `avtiveTime` varchar(20) DEFAULT NULL,
  `activeText` text,
  `activePlace` varchar(30) DEFAULT NULL,
  `activeState` int(10) DEFAULT NULL,
  PRIMARY KEY (`clubid`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of bookclub
-- ----------------------------
INSERT INTO `bookclub` VALUES ('1', '2', '交流会', '1998', '4', '6', '1');
INSERT INTO `bookclub` VALUES ('2', '7', '郊游12', '2000', '10', '20', '1');
INSERT INTO `bookclub` VALUES ('3', '11', '1234jj', '1998', '6', '8', '0');
INSERT INTO `bookclub` VALUES ('4', '12', 'jhjjk', '1996', 'xccdsfdfsd', '123', '1');
INSERT INTO `bookclub` VALUES ('5', '1', '吃的啥饭', '2013', '钓鱼', '后山', '1');
INSERT INTO `bookclub` VALUES ('6', '16', '吃的汉堡', '1999', '烧烤 ', '天台', '1');

-- ----------------------------
-- Table structure for circle
-- ----------------------------
DROP TABLE IF EXISTS `circle`;
CREATE TABLE `circle` (
  `circleid` int(10) NOT NULL AUTO_INCREMENT,
  `circleTime` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `circleText` text COLLATE utf8_bin,
  `circleState` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `openid` varchar(40) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`circleid`)
) ENGINE=InnoDB AUTO_INCREMENT=104 DEFAULT CHARSET=utf8 COLLATE=utf8_bin CHECKSUM=1 DELAY_KEY_WRITE=1 ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of circle
-- ----------------------------
INSERT INTO `circle` VALUES ('100', '2018/02/02 14:11:17', 0x31313131313131, '0', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4');
INSERT INTO `circle` VALUES ('101', '2018/02/02 19:34:51', 0xE8BF99E698AFE6B58BE8AF95E58685E5AEB9EFBC8CE8BF99E698AFE6B58BE8AF95E58685E5AEB9EFBC8CE8BF99E698AFE6B58BE8AF95E58685E5AEB9EFBC8CE8BF99E698AFE6B58BE8AF95E58685E5AEB9E38082, '0', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4');
INSERT INTO `circle` VALUES ('102', '2017/08/02 09:31:01', 0xE4BB8AE5A4A9E698AFE4B8AAE5A5BDE5A4A9E6B094, '0', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4');
INSERT INTO `circle` VALUES ('103', '2017/08/06 17:10:30', 0xE8BF99E698AFE6B58BE8AF95E58685E5AEB9EFBC8CE8BF99E698AFE6B58BE8AF95E58685E5AEB9EFBC8CE8BF99E698AFE6B58BE8AF95E58685E5AEB9EFBC8CE8BF99E698AFE6B58BE8AF95E58685E5AEB9E38082, '0', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4');

-- ----------------------------
-- Table structure for comment
-- ----------------------------
DROP TABLE IF EXISTS `comment`;
CREATE TABLE `comment` (
  `commentid` int(20) NOT NULL AUTO_INCREMENT,
  `commentTime` varchar(20) DEFAULT NULL,
  `commentText` text,
  `commentState` int(2) DEFAULT '0',
  `bookid` int(20) DEFAULT NULL,
  `openid` varchar(50) DEFAULT NULL,
  `nickName` varchar(20) DEFAULT NULL,
  `avatarUrl` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`commentid`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of comment
-- ----------------------------
INSERT INTO `comment` VALUES ('1', '2017-8-9   16:56:22', '1278425885好看', '1', '25', 'o8ioe0QBBylTUxaOvT_e180rRZwE', '*。。。？', 'https://wx.qlogo.cn/mmopen/vi_32/QNv3mOI06EBNPXzV3YvlPSRTOqpmUSX30XLqGOwhoicib0cibnQfstp6D8gwlYFtAiaiaviaXc9rkrj8pI8C4O1Lub1A/0');
INSERT INTO `comment` VALUES ('2', '2017-8-11   15:7:58', '', '1', '68', 'o8ioe0dfbxUFvuvuog1fQ2oiv890', 'rdgztest_RXKDRJ', '');
INSERT INTO `comment` VALUES ('3', '2017-8-11   16:55:10', '好', '1', '71', 'o8ioe0X8y_s3l0ZLGfqC8MzpcQAw', '易通科技单旭峰', 'https://wx.qlogo.cn/mmopen/vi_32/O5aCeeJs8qCBWV8sHPqyAwfP6HdkAq7MvianfckH7FXLj7V3nkyOF8QOhGl7uhLZMx024fCtic6kRjr0iap0jOrGg/0');
INSERT INTO `comment` VALUES ('4', '2017-8-11   19:25:33', '很不错的书籍', '1', '31', 'o8ioe0RsC3DLRILuLnz8eaOtAUv0', '渝-风', 'https://wx.qlogo.cn/mmopen/vi_32/J8THQW7DwpzNib04V03x4mjphcGiaBX25Licbd6ukbxX5WebwRE3bibBNhWdCPBqRx9Klred1l2l1m4L3haKZI2ygQ/0');
INSERT INTO `comment` VALUES ('5', '2017-8-11   19:34:4', '可以', '1', '75', 'o8ioe0QA-SPZN-iOgWdugf4Vgy4o', '夏有乔木丶雅望天堂', 'https://wx.qlogo.cn/mmopen/vi_32/dJ7r8flOEtumZHNFvWWhyfwtCGHgnayjZib74O2Eeh2dLBKEiciahZ4k8dtUSxCY8KxFgSwltNBpwicYvDfNq6ibiccQ/0');
INSERT INTO `comment` VALUES ('6', '2017-8-11   19:34:33', '666', '1', '25', 'o8ioe0QA-SPZN-iOgWdugf4Vgy4o', '夏有乔木丶雅望天堂', 'https://wx.qlogo.cn/mmopen/vi_32/dJ7r8flOEtumZHNFvWWhyfwtCGHgnayjZib74O2Eeh2dLBKEiciahZ4k8dtUSxCY8KxFgSwltNBpwicYvDfNq6ibiccQ/0');
INSERT INTO `comment` VALUES ('7', '2017-8-12   22:5:23', '攒一波人气', '1', '29', 'o8ioe0Ut3kOiANGwyw761tnLuqiU', '万里阳光', 'https://wx.qlogo.cn/mmopen/vi_32/n6AM77pZOedFiaGzC3wJ5lKDCia7ibpIMkeAhCynibMN2yqpbf2OQkoWTAc3kAQ9xrrnfqBKI0zbW8MYDWHuVg9xwg/0');
INSERT INTO `comment` VALUES ('8', '2017-8-13   15:49:19', '', '1', '71', 'o8ioe0Ut3kOiANGwyw761tnLuqiU', '万里阳光', 'https://wx.qlogo.cn/mmopen/vi_32/n6AM77pZOedFiaGzC3wJ5lKDCia7ibpIMkeAhCynibMN2yqpbf2OQkoWTAc3kAQ9xrrnfqBKI0zbW8MYDWHuVg9xwg/0');
INSERT INTO `comment` VALUES ('9', '2017-8-13   15:49:38', '好', '1', '71', 'o8ioe0Ut3kOiANGwyw761tnLuqiU', '万里阳光', 'https://wx.qlogo.cn/mmopen/vi_32/n6AM77pZOedFiaGzC3wJ5lKDCia7ibpIMkeAhCynibMN2yqpbf2OQkoWTAc3kAQ9xrrnfqBKI0zbW8MYDWHuVg9xwg/0');
INSERT INTO `comment` VALUES ('10', '2017-8-13   16:35:4', '', '1', '71', 'o8ioe0btvXjee7qTTPTXmNFZPRLU', 'rdgztest_HTBLOX', '');
INSERT INTO `comment` VALUES ('11', '2017-8-13   16:43:44', '', '1', '31', 'o8ioe0VjMUh9O57O83O5c3LYfqO4', 'rdgztest_BWHMAZ', '');
INSERT INTO `comment` VALUES ('12', '2017-8-13   16:54:3', '', '1', '32', 'o8ioe0btvXjee7qTTPTXmNFZPRLU', 'rdgztest_HTBLOX', '');
INSERT INTO `comment` VALUES ('13', '2017-8-15   9:46:17', '', '1', '25', 'o8ioe0YzZvLTDokowtLeIIqBMQBw', '稻草林', 'https://wx.qlogo.cn/mmopen/vi_32/7LWpMIQnwKiccy4lMtib0e03s6sdOSyMmRGo2E6CaYpkRkGBFOVrdabnjofAh4JvWxxLeViaaxw2cYia9xTnVq8fKA/0');
INSERT INTO `comment` VALUES ('14', '2017-8-15   14:1:12', '', '1', '71', 'o8ioe0Y7CUada6epwjJQoF9n8czM', '冬宝&Fatty-S', 'https://wx.qlogo.cn/mmopen/vi_32/Q0j4TwGTfTIrBbyfiaaVwCl7oTemvJ6GdO5Atdh3iaIibHRpPsX8ZTbEeq2bAjjnlbtvSYJ0ibp9iatNnT8Qcw4K2Fg/0');

-- ----------------------------
-- Table structure for feedback
-- ----------------------------
DROP TABLE IF EXISTS `feedback`;
CREATE TABLE `feedback` (
  `feedbackid` int(20) NOT NULL AUTO_INCREMENT,
  `feedbackTime` varchar(20) DEFAULT NULL,
  `feedbackText` text,
  `feedbackState` varchar(20) DEFAULT NULL,
  `feedbackResult` text,
  `openid` varchar(40) DEFAULT NULL,
  PRIMARY KEY (`feedbackid`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of feedback
-- ----------------------------
INSERT INTO `feedback` VALUES ('21', '2018/02/01 14:42:52', '1111', '0', null, 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4');
INSERT INTO `feedback` VALUES ('22', '2018/02/01 14:46:46', '*********', '0', null, 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4');

-- ----------------------------
-- Table structure for guide
-- ----------------------------
DROP TABLE IF EXISTS `guide`;
CREATE TABLE `guide` (
  `guideid` int(20) NOT NULL AUTO_INCREMENT,
  `guideTime` varchar(50) DEFAULT NULL,
  `guideText` text,
  `guideState` int(50) DEFAULT NULL,
  PRIMARY KEY (`guideid`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of guide
-- ----------------------------
INSERT INTO `guide` VALUES ('12', '2017-8-28', '请点击指南选项以解决您的问题', '1');
INSERT INTO `guide` VALUES ('13', '2017-8-28', '在书架上查找感兴趣的书籍->点击附近网点查找最近网点->打开扫码借书用二维码扫码->点击确认借书->查看订单状态别忘记还书哟！', '2');
INSERT INTO `guide` VALUES ('14', '2017-8-28', '押金定义：是指用户在注册乐享图书是为了使用乐享图书的服务所缴纳的一笔可以退换的款项，其目的在于激励用户合法、规范及文明的使用乐享图书，押金不可用于消费，用户可以随时申请退还', '2');
INSERT INTO `guide` VALUES ('15', '2017-8-28', '乐享图书为了实现用户还书即可离开，费用支付自动完成的流畅体验，用户需要充值支付费用。充值余额请点击app上“我的”->“钱包”->“余额充值”点击充值，其充值方式有微信支付和银行卡支付；充值之后，其余额用于支付借书订单，不设失效期，不能转移、转赠。充值余额可以退换', '1');
INSERT INTO `guide` VALUES ('16', '2017-8-28', '当您在app地图上与网点附近看到了乐享图书图标，这说明这个站点由您想要的书籍，当你发现站点没有书籍时或许是因为受周围环境影响，有时会偏移，请刷新页面查找下一个站点', '1');
INSERT INTO `guide` VALUES ('17', '2017-8-29', '7', '0');
INSERT INTO `guide` VALUES ('18', '2017-8-30', '1', '1');
INSERT INTO `guide` VALUES ('19', '2017-8-29', '9', '0');
INSERT INTO `guide` VALUES ('20', '2017-8-28', '0', '0');
INSERT INTO `guide` VALUES ('21', '2017-8-28', '12', '0');
INSERT INTO `guide` VALUES ('22', '2017-8-28', '12', '2');

-- ----------------------------
-- Table structure for lovingbook
-- ----------------------------
DROP TABLE IF EXISTS `lovingbook`;
CREATE TABLE `lovingbook` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `openid` varchar(40) DEFAULT NULL,
  `bookid` int(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of lovingbook
-- ----------------------------
INSERT INTO `lovingbook` VALUES ('7', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '10000');
INSERT INTO `lovingbook` VALUES ('10', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '10021');
INSERT INTO `lovingbook` VALUES ('13', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '10074');

-- ----------------------------
-- Table structure for operate
-- ----------------------------
DROP TABLE IF EXISTS `operate`;
CREATE TABLE `operate` (
  `openid` varchar(50) NOT NULL,
  `operatePhone` int(15) DEFAULT NULL,
  `operateName` varchar(20) DEFAULT NULL,
  `operateStoreid` int(20) DEFAULT NULL,
  PRIMARY KEY (`openid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of operate
-- ----------------------------
INSERT INTO `operate` VALUES ('a1234a', '2147483647', '王五', '2');
INSERT INTO `operate` VALUES ('c1234c', '2147483647', '李四', '3');
INSERT INTO `operate` VALUES ('d1234d', '2147483647', '赵六', '4');
INSERT INTO `operate` VALUES ('i12341', '2147483647', '张三', '1');
INSERT INTO `operate` VALUES ('q1234q', '2147483647', '琳琳', '5');

-- ----------------------------
-- Table structure for order
-- ----------------------------
DROP TABLE IF EXISTS `order`;
CREATE TABLE `order` (
  `orderid` int(20) NOT NULL AUTO_INCREMENT,
  `orderState` int(2) DEFAULT NULL,
  `startTime` varchar(20) DEFAULT NULL,
  `bookName` varchar(255) DEFAULT NULL,
  `bookStartPlace` varchar(255) DEFAULT NULL,
  `bookEndPlace` varchar(255) DEFAULT NULL,
  `endTime` varchar(20) DEFAULT NULL,
  `orderMoney` int(10) DEFAULT '0',
  `openid` varchar(50) DEFAULT NULL,
  `bookid` int(20) DEFAULT NULL,
  `payTime` varchar(50) DEFAULT NULL,
  `bookimgurl` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`orderid`)
) ENGINE=InnoDB AUTO_INCREMENT=74 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of order
-- ----------------------------
INSERT INTO `order` VALUES ('71', '0', '2018/02/02 20:05:36', '最后的精灵', '成华区', '青羊区', '2018/02/02 20:06:08', '2', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '10001', '2018/02/02 20:05:57', 'https://img1.doubanio.com/lpic/s3874387.jpg');
INSERT INTO `order` VALUES ('72', '0', '2018/02/02 20:06:29', '小王子', '龙泉驿区', '锦江区', '2018/02/02 20:06:49', '1', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '10000', '2018/02/02 20:06:42', 'https://img1.doubanio.com/lpic/s1237549.jpg');
INSERT INTO `order` VALUES ('73', '0', '2018/02/06 16:59:00', '夜莺与玫瑰', '青羊区', '龙泉驿区', '2018/02/06 16:59:29', '3', 'oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '10003', '2018/02/06 16:59:13', 'https://img3.doubanio.com/lpic/s10345525.jpg');

-- ----------------------------
-- Table structure for person
-- ----------------------------
DROP TABLE IF EXISTS `person`;
CREATE TABLE `person` (
  `identity` int(2) DEFAULT '0',
  `openid` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of person
-- ----------------------------

-- ----------------------------
-- Table structure for qrcode
-- ----------------------------
DROP TABLE IF EXISTS `qrcode`;
CREATE TABLE `qrcode` (
  `qrid` int(120) NOT NULL AUTO_INCREMENT,
  `access_token` varchar(130) DEFAULT NULL,
  PRIMARY KEY (`qrid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of qrcode
-- ----------------------------

-- ----------------------------
-- Table structure for store
-- ----------------------------
DROP TABLE IF EXISTS `store`;
CREATE TABLE `store` (
  `storeid` int(20) NOT NULL AUTO_INCREMENT,
  `storePlace` varchar(20) DEFAULT NULL,
  `storeName` varchar(20) DEFAULT NULL,
  `latitude` varchar(20) DEFAULT NULL,
  `longitude` varchar(20) DEFAULT NULL,
  `city` varchar(20) DEFAULT NULL,
  `image` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`storeid`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of store
-- ----------------------------
INSERT INTO `store` VALUES ('1', '武侯区', 'lynn测试图书店1', '30.6424200000', '104.0431100000', '四川成都', null);
INSERT INTO `store` VALUES ('2', '高新区', 'lynn测试图书店2', '30.5952300000', '104.0703900000', '四川成都', null);
INSERT INTO `store` VALUES ('3', '郫县', 'lynn测试图书店3', '30.7876900000', '103.8883500000', '四川成都', null);
INSERT INTO `store` VALUES ('4', '金牛区', 'lynn测试图书店4', '30.6901500000', '104.0529300000', '四川成都', null);
INSERT INTO `store` VALUES ('5', '青羊区', 'lynn测试图书店5', '30.6748500000', '104.0629100000', '四川成都', null);
INSERT INTO `store` VALUES ('6', '锦江区', 'lynn测试图书店6', '30.6561800000', '104.0832900000', '四川成都', null);
INSERT INTO `store` VALUES ('7', '成华区', 'lynn测试图书店7', '30.6598400000', '104.1019400000', '四川成都', null);
INSERT INTO `store` VALUES ('8', '龙泉驿区', 'lynn测试图书店8', '30.5566300000', '104.2747100000', '四川成都', null);
INSERT INTO `store` VALUES ('9', '新都区', 'lynn测试图书店9', '30.8240400000', '104.1580100000', '四川成都', null);
INSERT INTO `store` VALUES ('10', '青白江区', 'lynn测试图书店10', '30.8784900000', '104.2512200000', '四川成都', null);
INSERT INTO `store` VALUES ('11', '重庆邮电大学', 'lynn测试重邮图书', '29.5325700000', '106.6073400000', '重庆市', null);
INSERT INTO `store` VALUES ('12', '重庆解放碑', 'lynn测试图书解放碑8000', '29.5573000000', '106.5771500000', '重庆市', null);
INSERT INTO `store` VALUES ('13', '重庆观音桥', 'lynn测试图书观音桥店', '29.5725200000', '106.5335500000', '重庆市', null);

-- ----------------------------
-- Table structure for trade
-- ----------------------------
DROP TABLE IF EXISTS `trade`;
CREATE TABLE `trade` (
  `tradeid` int(100) NOT NULL AUTO_INCREMENT,
  `tradeTime` varchar(20) DEFAULT NULL,
  `tradeWay` int(10) DEFAULT NULL,
  `tradeMoney` double DEFAULT NULL,
  `openid` varchar(50) DEFAULT NULL,
  `orderid` int(10) DEFAULT NULL,
  `tradeFlag` int(10) DEFAULT NULL,
  PRIMARY KEY (`tradeid`)
) ENGINE=InnoDB AUTO_INCREMENT=10030 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of trade
-- ----------------------------
INSERT INTO `trade` VALUES ('10000', '2017-08-28 13:42:26', '0', '61.4', 'o8ioe0UdOLhQc3OZ9Y3AZruDzSgs', '0', '0');
INSERT INTO `trade` VALUES ('10001', '2017-08-30 13:43:28', '3', '60', 'o8ioe0UdOLhQc3OZ9Y3AZruDzSgs', null, null);
INSERT INTO `trade` VALUES ('10002', '2017-08-30 13:45:05', '1', '60', 'o8ioe0UdOLhQc3OZ9Y3AZruDzSgs', null, '1');
INSERT INTO `trade` VALUES ('10003', '2017-08-30 13:59:49', '4', '2', 'o8ioe0UdOLhQc3OZ9Y3AZruDzSgs', '38', null);
INSERT INTO `trade` VALUES ('10004', '2017-08-30 14:03:04', '2', '1', 'o8ioe0UdOLhQc3OZ9Y3AZruDzSgs', null, null);
INSERT INTO `trade` VALUES ('10005', '2017-08-30 14:06:31', '5', '2', 'o8ioe0UdOLhQc3OZ9Y3AZruDzSgs', '39', null);
INSERT INTO `trade` VALUES ('10006', '2017-08-30 16:01:00', '5', '2', 'o8ioe0UdOLhQc3OZ9Y3AZruDzSgs', '40', null);
INSERT INTO `trade` VALUES ('10007', '2017-08-30 17:19:20', '1', '60', 'o8ioe0Ut3kOiANGwyw761tnLuqiU', null, '0');
INSERT INTO `trade` VALUES ('10008', '2017-08-30 16:57:23', '1', '60', 'o8ioe0ey2pPDFtpBZZpDM5oStNjY', null, '0');
INSERT INTO `trade` VALUES ('10009', '2017-08-30 21:11:39', '4', '2', 'o8ioe0UdOLhQc3OZ9Y3AZruDzSgs', '44', null);
INSERT INTO `trade` VALUES ('10010', '2017-08-30 22:20:28', '2', '10', 'o8ioe0X8y_s3l0ZLGfqC8MzpcQAw', null, null);
INSERT INTO `trade` VALUES ('10011', '2017-08-30 22:22:25', '1', '60', 'o8ioe0X8y_s3l0ZLGfqC8MzpcQAw', null, '0');
INSERT INTO `trade` VALUES ('10012', '2017-08-30 22:26:34', '4', '2', 'o8ioe0X8y_s3l0ZLGfqC8MzpcQAw', '48', null);
INSERT INTO `trade` VALUES ('10013', '2017-08-30 23:01:45', '3', '60', 'o8ioe0UdOLhQc3OZ9Y3AZruDzSgs', null, null);
INSERT INTO `trade` VALUES ('10014', '2017-08-30 23:02:38', '1', '60', 'o8ioe0UdOLhQc3OZ9Y3AZruDzSgs', null, '1');
INSERT INTO `trade` VALUES ('10015', '2017-08-30 23:03:03', '3', '60', 'o8ioe0UdOLhQc3OZ9Y3AZruDzSgs', null, null);
INSERT INTO `trade` VALUES ('10016', '2017-08-30 23:30:43', '1', '60', 'o8ioe0UdOLhQc3OZ9Y3AZruDzSgs', null, '0');
INSERT INTO `trade` VALUES ('10017', '2017-08-30 13:15:04', '1', '60', 'o8ioe0TPZOTgRiB_ozs-MShtOFmU', null, '0');
INSERT INTO `trade` VALUES ('10018', '2017-08-30 12:24:26', '4', '2', 'o8ioe0X8y_s3l0ZLGfqC8MzpcQAw', '49', null);
INSERT INTO `trade` VALUES ('10019', '2017-08-30 12:25:37', '4', '2', 'o8ioe0X8y_s3l0ZLGfqC8MzpcQAw', '50', null);
INSERT INTO `trade` VALUES ('10024', '2017-08-30 12:33:49', '4', '2', 'o8ioe0X8y_s3l0ZLGfqC8MzpcQAw', '51', null);
INSERT INTO `trade` VALUES ('10025', '2017-08-30 16:56:52', '4', '2', 'o8ioe0X8y_s3l0ZLGfqC8MzpcQAw', '52', null);
INSERT INTO `trade` VALUES ('10026', '2017-08-30 16:58:46', '2', '10', 'o8ioe0Ut3kOiANGwyw761tnLuqiU', null, null);
INSERT INTO `trade` VALUES ('10027', '2017-08-30 17:01:56', '4', '2', 'o8ioe0Ut3kOiANGwyw761tnLuqiU', '53', null);
INSERT INTO `trade` VALUES ('10028', '2017-08-30 17:06:09', '4', '2', 'o8ioe0X8y_s3l0ZLGfqC8MzpcQAw', '54', null);
INSERT INTO `trade` VALUES ('10029', '2017-08-30 19:39:35', '1', '60', 'o8ioe0QA-SPZN-iOgWdugf4Vgy4o', null, '0');

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `openid` varchar(30) NOT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `name` varchar(20) DEFAULT NULL,
  `userState` int(2) DEFAULT NULL,
  `point` int(10) DEFAULT '0',
  `deposit` int(10) DEFAULT '0',
  `money` double DEFAULT '0',
  `nickName` varchar(255) DEFAULT NULL,
  `avatarUrl` varchar(10000) DEFAULT NULL,
  PRIMARY KEY (`openid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('oBmd_4m3jPD1IeN5xI1e5KI2Z7N4', '123', 'lynn', '0', '3', '666', '94', 'LYNN*', 'https://wx.qlogo.cn/mmopen/vi_32/81v5I11OBwtm1DPXPiaLcEnFbT9q5ChcOBBKZLcJDcz8aXNy6UeY6R523RVSC870QPavA88DCfCbXvmJib9Rfiacw/0');

-- ----------------------------
-- View structure for returnmonthrptstore
-- ----------------------------
DROP VIEW IF EXISTS `returnmonthrptstore`;
CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`%` SQL SECURITY DEFINER VIEW `returnmonthrptstore` AS (select `book`.`bookid` AS `bookid`,`book`.`bookname` AS `bookname`,`book`.`author` AS `author`,`book`.`bookManPhone` AS `bookManPhone`,`book`.`bookState` AS `bookState`,`book`.`bookMoney` AS `bookMoney`,`book`.`bookPlace` AS `bookPlace`,`book`.`bookcount` AS `bookcount`,`book`.`bookRoute` AS `bookRoute`,`book`.`bookIntroduce` AS `bookIntroduce`,`book`.`bookflag` AS `bookflag`,`book`.`storeid` AS `storeid`,`book`.`bookimgurl` AS `bookimgurl`,`book`.`bookclass` AS `bookclass`,`book`.`scene` AS `scene`,`book`.`average` AS `average`,`book`.`publisher` AS `publisher`,`book`.`pubdate` AS `pubdate`,`book`.`tags0` AS `tags0`,`book`.`tags1` AS `tags1`,`book`.`tags2` AS `tags2`,`book`.`isbn10` AS `isbn10`,`book`.`isbn13` AS `isbn13` from `book`) ;
